---
kind: method
id: M:Autodesk.Revit.UI.RibbonPanel.AddSeparator
zh: 功能区
source: html/2fa98df9-0384-e3a6-65f9-a4529b87ed36.htm
---
# Autodesk.Revit.UI.RibbonPanel.AddSeparator Method

**中文**: 功能区

Adds a new Separator to the panel.

## Syntax (C#)
```csharp
public void AddSeparator()
```

## Remarks
The separator won't be shown if there are no items already added to the panel.